var classes = {
  "Информатика и вычислительная техника" : {
    "Вычислительные машины, комплексы, системы и сети" : {
      "1": [
        "Процедурное программирование",
        "Информатика",
        "Математический анализ",
        "Физика",
        "История"
      ],
      "2": [
        "ООП",
        "ООП(Курсовая работа)",
        "Физика",
        "Дискретная математика",
        "Алгебра и геометрия"
      ],
      "3": [
        "Разработка программных приложений",
        "Математическая логика и теория алгоритмов",
        "Математический анализ",
        "Электротехника",
        "Философия"
      ],
      "4": [
        "Архитектура вычислительных машин",
        "Системная и программная инженерия",
        "Теория вероятностей, мат. статика и случ. процессы",
        "Теория автоматов",
        "Иностранный язык"
      ],
      "5": [
        "Информационные системы и базы данных",
        "Схемотехника ЭВМ",
        "Вычислительная математика",
        "Структура операционных устройств",
        "Теория приятия решений"
      ],
      "6": [
        "Сети ЭВМ и телекоммуникации",
        "Микропроцессорные системы",
        "Моделирование",
        "Системное программное обеспечение",
        "Интерфейсы и переферийные устройства"
      ],
      "7": [
        "Микропроцессорные системы",
        "Аппаратно-программное обеспечение ЭВМ",
        "Сети ЭВМ и телекоммуникации",
        "Аппаратно-программные средства компьютерных сетей",
        "Защита информации"
      ]
    },
    "Информационно-аналитические и управляющие системы" : {
      "1": [
        "Процедурное программирование",
        "Информатика",
        "Математический анализ",
        "Физика",
        "История"
      ],
      "2": [
        "ООП",
        "ООП(Курсовая работа)",
        "Физика",
        "Дискретная математика",
        "Алгебра и геометрия"
      ],
      "3": [
        "Разработка программных приложений",
        "Математическая логика и теория алгоритмов",
        "Математический анализ",
        "Электротехника",
        "Философия"
      ],
      "4": [
        "Архитектура вычислительных машин и систем",
        "Системная и программная инженерия",
        "Теория вероятностей, мат. статика и случ. процессы",
        "Модели динамики информационных систем",
        "Иностранный язык"
      ],
      "5": [
        "Исследование операций",
        "Информационные системы и базы данных",
        "Вычислительная математика",
        "Уравнения в частных производных",
        "Теория приятия решений"
      ],
      "6": [
        "Методы интеллектуального анализа данных",
        "OLAP и другие технологии организации, обработки и хранения данных",
        "Теория оптимального управления",
        "Математические методы в информационных технологиях",
        "Имитационное моделирование динамических систем"
      ],
      "7": [
        "Технология создания программного продукта",
        "Математические основы информационной безопасности",
        "Методы оптимизации",
        "Математическое моделирование",
        "Математические модели в экономике"
      ]
    },
    "Математическое и программное обеспечение вычислительной техники и автоматизированных систем" : {
      "1": [
        "Процедурное программирование",
        "Информатика",
        "Математический анализ",
        "Физика",
        "История"
      ],
      "2": [
        "ООП",
        "ООП(Курсовая работа)",
        "Физика",
        "Дискретная математика",
        "Алгебра и геометрия"
      ],
      "3": [
        "Разработка программных приложений",
        "Математическая логика и теория алгоритмов",
        "Математический анализ",
        "Электротехника",
        "Философия"
      ],
      "4": [
        "Архитектура вычислительных машин и систем",
        "Системная и программная инженерия",
        "Теория вероятностей, мат. статика и случ. процессы",
        "Технологии разработки программного обеспечения",
        "Иностранный язык"
      ],
      "5": [
        "Информационные системы и базы данных",
        "Основы программирования микропроцессоров",
        "Вычислительная математика",
        "Структуры и алгоритмы обработки данных",
        "Параллельное программирование"
      ],
      "6": [
        "Объектно-ориентированный анализ и проектирование программного обеспечения",
        "Функциональное и логическое программирование",
        "Операционные системы",
        "Техническое обеспечение автоматизированных систем",
        "Системы тестирования программного обеспечения"
      ],
      "7": [
        "Информационные технологии интернета вещей",
        "Проектирование интеллектуальных систем",
        "Сети ЭВМ и телекоммуникации",
        "Моделирование систем",
        "Технико-экономическое обоснование задач автоматизации"
      ]
    },
    "Промышленная информатика" : {
      "1": [
        "Процедурное программирование",
        "Информатика",
        "Математический анализ",
        "Физика",
        "История"
      ],
      "2": [
        "ООП",
        "ООП(Курсовая работа)",
        "Физика",
        "Дискретная математика",
        "Алгебра и геометрия"
      ],
      "3": [
        "Разработка программных приложений",
        "Математическая логика и теория алгоритмов",
        "Математический анализ",
        "Электротехника",
        "Философия"
      ],
      "4": [
        "Архитектура вычислительных машин и систем",
        "Системная и программная инженерия",
        "Теория вероятностей, мат. статика и случ. процессы",
        "Теория конечных автоматов",
        "Иностранный язык"
      ],
      "5": [
        "Информационные системы и базы данных",
        "Автоматное программирование систем управления",
        "Вычислительная математика",
        "Цифровые системы управления",
        "Технические измерения и приборы"
      ],
      "6": [
        "Мехатроника промышленных систем",
        "Промышленная информатика",
        "Технические средства автоматизации и управления",
        "Цифровые системы управления",
        "Вычислительные системы реального времени"
      ],
      "7": [
        "Проектирование аппаратно-программных комплексов",
        "Технические средства автоматизации и управления",
        "Вычислительные системы реального времени",
        "Промышленные сети",
        "Дизайн интерфейсов систем управления"
      ]
    }
  },
  "Прикладная информатика" : {
    "Информатизация организаций" : {
      "1": [
        "Процедурное программирование",
        "Информатика",
        "Математический анализ",
        "Физика",
        "История"
      ],
      "2": [
        "ООП",
        "Развитие информационного общества",
        "Физика",
        "Дискретная математика",
        "Алгебра и геометрия"
      ],
      "3": [
        "Численные методы",
        "Моделирование бизнес процессов",
        "Математический анализ",
        "Системный анализ и моделирование",
        "Философия"
      ],
      "4": [
        "Архитектура вычислительных машин и систем",
        "Разработка программных приложений",
        "Теория вероятности и математическая статистика",
        "Системная и программная инженерия",
        "Иностранный язык"
      ],
      "5": [
        "Проектирование и разработка баз данных",
        "Анализ и управление бизнес процессами",
        "Информационные системы и технологии",
        "Анализ и управление бизнес процессами (курсовая)",
        "Экономика информационного общества"
      ],
      "6": [
        "Архитектура организаций",
        "Проектирование информационных систем",
        "Предметно-ориентированные информационные системы",
        "Администрирование баз данных",
        "Компьютерная графика"
      ],
      "7": [
        "Управление ИТ проектами",
        "Электронный бизнес и электронная коммерция",
        "Управление ИТ проектами (курсовая)",
        "Контроллинг",
        "Информационные технологии бизнес планирования"
      ]
    }
  },
  "Программная инженерия" : {
    "Корпоративные информационные системы" : {
      "1": [
        "Процедурное программирование",
        "Информатика",
        "Математический анализ",
        "Физика",
        "История"
      ],
      "2": [
        "ООП",
        "ООП(Курсовая работа)",
        "Физика",
        "Дискретная математика",
        "Алгебра и геометрия"
      ],
      "3": [
        "Структура и алгоритмы обработки данных",
        "Моделирование бизнес процессов",
        "Математический анализ",
        "Математическая логика и теория алгоритмов",
        "Философия"
      ],
      "4": [
        "Архитектура вычислительных машин и систем",
        "Разработка программных приложений",
        "Теория вероятности и математическая статистика",
        "Системная и программная инженерия",
        "Иностранный язык"
      ],
      "5": [
        "Проектирование и разработка баз данных",
        "Разработка клиент-серверных приложений",
        "Информационные системы и технологии",
        "Корпоративные информационные системы",
        "Оценка качества информационных систем"
      ],
      "6": [
        "Интеллектуальные системы и технологии",
        "Проектирование информационных систем",
        "Моделирование систем",
        "Информационная безопасность и защита информации",
        "Теория систем и системный анализ"
      ],
      "7": [
        "Управление ИТ проектами",
        "Разработка программного обеспечения для корпоративных информационных систем",
        "Безопасность функционирования информационных систем",
        "Открытые информационные системы",
        "Мировые информационные ресурсы"
      ]
    },
    "Разработка программных продуктов и проектирование информационных систем" : {
      "1": [
        "Процедурное программирование",
        "Информатика",
        "Математический анализ",
        "Физика",
        "История"
      ],
      "2": [
        "ООП",
        "ООП(Курсовая работа)",
        "Физика",
        "Дискретная математика",
        "Алгебра и геометрия"
      ],
      "3": [
        "Структура и алгоритмы обработки данных",
        "Моделирование бизнес процессов",
        "Математический анализ",
        "Математическая логика и теория алгоритмов",
        "Философия"
      ],
      "4": [
        "Архитектура вычислительных машин и систем",
        "Разработка программных приложений",
        "Теория вероятности и математическая статистика",
        "Системная и программная инженерия",
        "Иностранный язык"
      ],
      "5": [
        "Проектирование и разработка баз данных",
        "Разработка клиент-серверных приложений",
        "Информационные системы и технологии",
        "Разработка клиент-серверных приложений (курсовая)",
        "Теория автоматов и формальных языков"
      ],
      "6": [
        "Тестирование и отладка программного обеспечения",
        "Проектирование информационных систем",
        "Системное программное обеспечение",
        "Компьютерная графика",
        "Теория систем и системный анализ"
      ],
      "7": [
        "Управление ИТ проектами",
        "Системы управления ИТ сервисами и контентом",
        "Информационная безопасность программных продуктов и систем",
        "Качество и стандартизация программных продуктов и систем",
        "Тестирование и отладка программного обеспечения (курсовая)"
      ]
    }
    "Системная и программная инженерия" : {
      "1": [
        "Процедурное программирование",
        "Информатика",
        "Математический анализ",
        "Физика",
        "История"
      ],
      "2": [
        "ООП",
        "ООП(Курсовая работа)",
        "Физика",
        "Дискретная математика",
        "Алгебра и геометрия"
      ],
      "3": [
        "Структура и алгоритмы обработки данных",
        "Моделирование бизнес процессов",
        "Математический анализ",
        "Математическая логика и теория алгоритмов",
        "Философия"
      ],
      "4": [
        "Архитектура вычислительных машин и систем",
        "Разработка программных приложений",
        "Теория вероятности и математическая статистика",
        "Программная инженерия",
        "Иностранный язык"
      ],
      "5": [
        "Проектирование и разработка баз данных",
        "Функциональное и логическое программирование",
        "Информационные системы и технологии",
        "Функциональное и логическое программирование (курсовая)",
        "Операционные системы"
      ],
      "6": [
        "Технологии разработки программного обеспечения",
        "Проектирование информационных систем",
        "Системы поддержки принятия решений",
        "Теория автоматов и формальных языков",
        "Теория систем и системный анализ"
      ],
      "7": [
        "Вычислительные сети и телекоммуникации",
        "Теоретические основы интернета вещей",
        "Технологии разработки программного обеспечения",
        "Технологии разработки программного обеспечения (курсовая)",
        "Методы и средства защиты компьютерной информации"
      ]
    },
    "Системы поддержки принятия решений" : {
      "1": [
        "Процедурное программирование",
        "Информатика",
        "Математический анализ",
        "Физика",
        "История"
      ],
      "2": [
        "ООП",
        "ООП(Курсовая работа)",
        "Физика",
        "Дискретная математика",
        "Алгебра и геометрия"
      ],
      "3": [
        "Структура и алгоритмы обработки данных",
        "Моделирование бизнес процессов",
        "Математический анализ",
        "Математическая логика и теория алгоритмов",
        "Философия"
      ],
      "4": [
        "Архитектура вычислительных машин и систем",
        "Разработка программных приложений",
        "Теория вероятности и математическая статистика",
        "Системная и программная инженерия",
        "Иностранный язык"
      ],
      "5": [
        "Проектирование и разработка баз данных",
        "Разработка клиент-серверных приложений",
        "Информационные системы и технологии",
        "Разработка клиент-серверных приложений (курсовая)",
        "Теория автоматов и формальных языков"
      ],
      "6": [
        "Структуры сетевых баз данных",
        "Проектирование информационных систем",
        "Интеллектуальные системы",
        "Теория принятия решений",
        "Теория систем и системный анализ"
      ],
      "7": [
        "Интеллектуальный анализ данных",
        "Технологии разработки программного обеспечения",
        "Программное обеспечение интеллектуальных систем",
        "Программирование микропроцессорных систем",
        "Информационная безопасность"
      ]
    }
  },
  "Автоматизация технологических процессов и производств" : {
    "Автоматизация технологических процессов и производств в промышленности" : {
      "1": [
        "Процедурное программирование",
        "Информатика",
        "Математический анализ",
        "Физика",
        "История"
      ],
      "2": [
        "ООП",
        "Математические основы автоматизированных систем",
        "Физика",
        "Дискретная математика",
        "Алгебра и геометрия"
      ],
      "3": [
        "Теоретическая механика",
        "Конструкторско-технологическая информатика (курсовая)",
        "Математический анализ",
        "Физика",
        "Философия"
      ],
      "4": [
        "Электроника систем автоматизации",
        "Основы конструирования машин",
        "Теория вероятностей, математическая статистика и случайные процессы",
        "Теория конечных автоматов",
        "Иностранный язык"
      ],
      "5": [
        "Промышленная информатика",
        "Автоматное программирование систем управления",
        "Теория автоматического управления",
        "Электромеханические и мехатронные системы",
        "Технические измерения и приборы"
      ],
      "6": [
        "Технологическое оборудование автоматизированных производств",
        "Технологии автоматизированных производств",
        "Технические средства автоматизации и управления",
        "Теория автоматического управления",
        "Пневматические и гидравлические мехатронные системы"
      ],
      "7": [
        "Надежность и диагностика автоматизированных систем",
        "Автоматизация технологических процессов и производств",
        "Технические средства автоматизации и управления",
        "Промышленные сети",
        "Теория систем и системный анализ"
      ]
    }
  }
};
