$(document).ready(function(){
  $('.progress').progress();
});

let classes = {
  'Информатика и вычислительная техника' : {
    'Вычислительные машины, комплексы, системы и сети' : {

    },
    'Информационно-аналитические и управляющие системы' : {

    },
    'Математическое и программное обеспечение вычислительной техники и автоматизированных систем' : {

    },
    'Промышленная информатика' : {

    }
  },
  'Прикладная информатика' : {
    'Информатизация организаций' : {

    }
  },
  'Программная инженерия' : {
    'Корпоративные информационные системы' : {

    },
    'Системная и программная инженерия' : {

    },
    'Системы поддержки принятия решений' : {

    },
    'Разработка программных продуктов и проектирование информационных систем' : {

    }
  },
  'Автоматизация технологических процессов и производств' : {
    'Автоматизация технологических процессов и производств в промышленности' : {

    }
  }
};

function openModal(term){

}
